In [1]:
import mysql.connector as conn

In [2]:
mydb=conn.connect(host="localhost", user="root", password="r@shika123")

In [3]:
cursor=mydb.cursor()

In [4]:
cursor.execute("use organisation")

In [5]:
cursor.execute("show tables")

In [6]:
cursor.fetchall()

[('employee',),
 ('employee1',),
 ('employee_email',),
 ('employee_new',),
 ('employee_table1',),
 ('mathematics',),
 ('mathematics_cod',),
 ('mathematics_codes',),
 ('mathematics_codes1',),
 ('mathematics_codes11',),
 ('mathematics_data',),
 ('worker_table',)]

# Q-1. Write an SQL query to show the top n (say 10) records of a table.

In [7]:
import pandas as pd
pd.read_sql('select * from organisation.employee_table1',mydb)

   emp_id      Name          Address  Salary       City
0       1   Sanchit       AshokNagar  950000  TamilNadu
1       2    Shilpa        ModelTown  555000     Ranchi
2       3  Priyanka  Indrapuri nagar  550070        Goa
3       4    Sachin  janakpuri nagar  550000     Bombay
4       5    Sachin  janakpuri nagar  550000     Bombay
5       6   Swapnil     Royal colony  650000  JHARKHAND
6       7     Ronak  janakpuri nagar  750000      Bihar
7       8   Anushka      Bommanhalli  550000  Bengaluru
8       9   Swapnil     Royal colony  650000  JHARKHAND
9      10   Swapnil     Royal colony  650000  JHARKHAND

In [8]:
cursor.execute("select * from employee_table1 order by salary desc limit 10")

In [9]:
cursor.fetchall()

[(1, 'Sanchit', 'AshokNagar', 950000, 'TamilNadu'),
 (7, 'Ronak', 'janakpuri nagar', 750000, 'Bihar'),
 (6, 'Swapnil', 'Royal colony', 650000, 'JHARKHAND'),
 (9, 'Swapnil', 'Royal colony', 650000, 'JHARKHAND'),
 (10, 'Swapnil', 'Royal colony', 650000, 'JHARKHAND'),
 (2, 'Shilpa', 'ModelTown', 555000, 'Ranchi'),
 (3, 'Priyanka', 'Indrapuri nagar', 550070, 'Goa'),
 (4, 'Sachin', 'janakpuri nagar', 550000, 'Bombay'),
 (5, 'Sachin', 'janakpuri nagar', 550000, 'Bombay'),
 (8, 'Anushka', 'Bommanhalli', 550000, 'Bengaluru')]

# Q-2. Write an SQL query to determine the nth (say n=5) highest salary from a table.

In [10]:
import pandas as pd
pd.read_sql('select * from organisation.employee_table1',mydb)

   emp_id      Name          Address  Salary       City
0       1   Sanchit       AshokNagar  950000  TamilNadu
1       2    Shilpa        ModelTown  555000     Ranchi
2       3  Priyanka  Indrapuri nagar  550070        Goa
3       4    Sachin  janakpuri nagar  550000     Bombay
4       5    Sachin  janakpuri nagar  550000     Bombay
5       6   Swapnil     Royal colony  650000  JHARKHAND
6       7     Ronak  janakpuri nagar  750000      Bihar
7       8   Anushka      Bommanhalli  550000  Bengaluru
8       9   Swapnil     Royal colony  650000  JHARKHAND
9      10   Swapnil     Royal colony  650000  JHARKHAND

In [11]:
cursor.execute("select name,salary from employee_table1 order by salary desc")

In [12]:
cursor.fetchall()

[('Sanchit', 950000),
 ('Ronak', 750000),
 ('Swapnil', 650000),
 ('Swapnil', 650000),
 ('Swapnil', 650000),
 ('Shilpa', 555000),
 ('Priyanka', 550070),
 ('Sachin', 550000),
 ('Sachin', 550000),
 ('Anushka', 550000)]

In [13]:
#cursor.execute("select top 5 * from employee_table1")

# OR

In [14]:
cursor.execute("select * from employee_table1 order by salary desc limit 5")

In [15]:
cursor.fetchall()

[(1, 'Sanchit', 'AshokNagar', 950000, 'TamilNadu'),
 (7, 'Ronak', 'janakpuri nagar', 750000, 'Bihar'),
 (6, 'Swapnil', 'Royal colony', 650000, 'JHARKHAND'),
 (9, 'Swapnil', 'Royal colony', 650000, 'JHARKHAND'),
 (10, 'Swapnil', 'Royal colony', 650000, 'JHARKHAND')]

                                     Keep Learning, Keep Growing...